os2web_acadre_arp/test_data/request-6.soap_2.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><Publish xmlns="http://Acadre.Publishing.CMS.PublishingHandler.Demo"><info><ItemId xmlns="http://schemas.datacontract.org/2004/07/Acadre.Publishing.CMS.PublishingHandler.Demo">f6db0d0e-cdef-4b9e-b68f-7c67136f916c</ItemId><LocationId xmlns="http://schemas.datacontract.org/2004/07/Acadre.Publishing.CMS.PublishingHandler.Demo">default</LocationId><Metadata xmlns="http://schemas.datacontract.org/2004/07/Acadre.Publishing.CMS.PublishingHandler.Demo">&lt;?xml version="1.0" encoding="utf-16"?&gt;
&lt;PublishedMemo xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://www.traen.com/2007/20/07/"&gt;
  &lt;Title&gt;Test Notat&lt;/Title&gt;
  &lt;MemoTypeLiteral&gt;Emnejour&lt;/MemoTypeLiteral&gt;
  &lt;MemberSequenceNumber&gt;1&lt;/MemberSequenceNumber&gt;
  &lt;EventDate&gt;31-07-2012 00:00:00&lt;/EventDate&gt;
  &lt;CreationDate&gt;31-07-2012 12:13:28&lt;/CreationDate&gt;
  &lt;CreatorUser&gt;
    &lt;UserInitials&gt;acadre&lt;/UserInitials&gt;
    &lt;UserName&gt;acadre&lt;/UserName&gt;
  &lt;/CreatorUser&gt;
  &lt;FileFormat&gt;RTF&lt;/FileFormat&gt;
  &lt;Deadline&gt;2012-08-01&lt;/Deadline&gt;
&lt;/PublishedMemo&gt;</Metadata><PhysicalFileReference xmlns="http://schemas.datacontract.org/2004/07/Acadre.Publishing.CMS.PublishingHandler.Demo"><FileName>Memo_ 31-07-2012 12_13_27.rtf</FileName><ItemId>165068</ItemId><Version>1</Version></PhysicalFileReference></info><parentItemId>f6db0d0e-cdef-4b9e-b68f-7c67136f916c</parentItemId></Publish></soap:Body></soap:Envelope>